back/app/models/pack_creation.rb

  def pack_cards
    pack = pack_rarities
    cards = Array.new
    for rarity in pack
      card = OriginalCard.where(cardtype: rarity).sample
---
SELECT `original_cards`.* FROM `original_cards` WHERE `original_cards`.`Cardtype` = 0