back/app/controllers/api/v1/original_cards_controller.rb

SELECT `original_cards`.* FROM `original_cards`
---
  def unapproved
    unapproved_cards = OriginalCard.select {|cards| !cards.approved? }

SELECT `original_cards`.* FROM `original_cards` WHERE `original_cards`.`id` = 9 LIMIT 1
UPDATE `original_cards` SET `original_cards`.`updated_at` = '2025-12-26 00:03:39.590319', `original_cards`.`approved` = TRUE WHERE `original_cards`.`id` = 27
UPDATE `original_cards` SET `original_cards`.`updated_at` = '2026-01-08 02:26:28.242501', `original_cards`.`approved` = TRUE WHERE `original_cards`.`id` = 106
---
  def approved
    api_results = []
    for i in params[:ids]
      unapproved_card = OriginalCard.find_by(id: i)
      result = Cloudinary::Api.update("#{unapproved_card.season}/Unapproved/#{unapproved_card.api_id}",asset_folder: "#{unapproved_card.season}/#{unapproved_card.cardtype}/")
      if result
        unapproved_card.update_attribute(:approved, true)

SELECT `original_cards`.* FROM `original_cards` WHERE `original_cards`.`id` = 121 LIMIT 1
DELETE FROM `original_cards` WHERE `original_cards`.`id` = 121
---
  def delete_cards
    for i in params[:ids]
      unapproved_card = OriginalCard.find_by(id: i)
      result = Cloudinary::Uploader.destroy("#{unapproved_card.season}/Unapproved/#{unapproved_card.api_id}")
      if result
        unapproved_card.destroy

SELECT `original_cards`.* FROM `original_cards` WHERE `original_cards`.`id` = 1 LIMIT 1
---
    def set_original_card
      @original_card = OriginalCard.find(params.expect(:id))

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `original_cards` (`created_at`, `updated_at`, `name`, `cardtype`, `approved`, `api_id`, `season`) VALUES ('2026-01-08 04:27:44.282907', '2026-01-08 04:27:44.282907', 'archie lynch', 0, FALSE, 'tubs88ddvmg6tqmrzhif', 24)
---
    def create_original_card(file, file_args)
      user = User.find_by(id: session[:current_user_id])
      if user.card_approver?
        result = Cloudinary::Uploader.upload(file, folder: file_args[2]+"/"+file_args[1].capitalize)
        result['public_id'].slice! file_args[2]+"/"+file_args[1]+"/"
        original_card = OriginalCard.new(name: file_args[0], cardtype: file_args[1].capitalize, approved: true, api_id: result['public_id'], season:file_args[2])
      else
        result = Cloudinary::Uploader.upload(file, folder: file_args[2]+"/Unapproved")
        result['public_id'].slice! file_args[2]+"/Unapproved/"
        original_card = OriginalCard.new(name: file_args[0], cardtype: file_args[1].capitalize, approved: false, api_id: result['public_id'], season:file_args[2])
      end

      if original_card.save