back/app/controllers/api/v1/user_cards_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
INSERT INTO `user_cards` (`created_at`, `updated_at`, `user_id`, `uuid`, `cardtype`, `season`, `api_id`, `card_name`) VALUES ('2026-01-03 00:25:33.769352', '2026-01-03 00:25:33.769352', 3, x'4a799f4750894b7ebc1853567141e380', 0, 23, 'lvcystzlq6fqskkkyeeo', '2')
INSERT INTO `user_cards` (`created_at`, `updated_at`, `user_id`, `uuid`, `cardtype`, `season`, `api_id`, `card_name`) VALUES ('2026-01-03 05:04:46.851831', '2026-01-03 05:04:46.851831', 3, x'616c9bd8762f44adaf36d5d74d0b6bd0', 0, 23, 'lvcystzlq6fqskkkyeeo', '2')
---
  def pack
    user = User.find_by(id: session[:current_user_id])
    pack = PackCreation.new.pack_cards
    card_public_ids = Array.new
    unless user
      return render json: { error: "You must be logged in" }, status: :unauthorized
    end
    UserCard.transaction do
      pack.each do |card|
        @new_card = UserCard.create(user: user, season: 23, cardtype: card.cardtype, api_id: card.api_id )
        @new_card.save!