back/app/controllers/api/v1/user_cards_controller.rb

  def index
    @user_cards = UserCard.where(user_id: session[:current_user_id])
---
SELECT `user_cards`.* FROM `user_cards` WHERE `user_cards`.`user_id` = 3

  def get_user_card_count
    user_cards = UserCard.where(user_id: session[:current_user_id]).count
---
SELECT COUNT(*) FROM `user_cards` WHERE `user_cards`.`user_id` = 3

  def cards_with_params
    puts default_per_page
    if params[:cardtype].empty?
      @user_cards = UserCard.where(
        "user_id = ? AND card_name LIKE ?",
        session[:current_user_id],
        "%#{params[:name]}%"
      )
      @user_cards = @user_cards.then(&paginate)

      render json: @user_cards
    elsif params[:name].empty?

      @user_cards = UserCard.where(user_id: session[:current_user_id], cardtype: params[:cardtype])
      @user_cards = @user_cards.then(&paginate)

      render json: @user_cards
    else
      @user_cards = UserCard.where(user_id: session[:current_user_id], cardtype: params[:cardtype], card_name: params[:name])
---
SELECT `user_cards`.* FROM `user_cards` WHERE `user_cards`.`user_id` = 3 AND `user_cards`.`card_name` = '1'
SELECT `user_cards`.* FROM `user_cards` WHERE `user_cards`.`user_id` = 3 AND `user_cards`.`cardtype` = 0
SELECT `user_cards`.* FROM `user_cards` WHERE `user_cards`.`user_id` = 3 AND `user_cards`.`cardtype` = 0 AND `user_cards`.`card_name` = '1' LIMIT 10 OFFSET 0

  def pack
    user = User.find_by(id: session[:current_user_id])
    pack = PackCreation.new.pack_cards
    card_public_ids = Array.new
    unless user
      return render json: { error: "You must be logged in" }, status: :unauthorized
    end
    UserCard.transaction do
      pack.each do |card|
        @new_card = UserCard.create(user: user, season: 23, cardtype: card.cardtype, api_id: card.api_id, card_name: card.name )
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 4 LIMIT 1
INSERT INTO `user_cards` (`created_at`, `updated_at`, `user_id`, `uuid`, `cardtype`, `season`, `api_id`, `card_name`) VALUES ('2026-01-03 00:25:33.769352', '2026-01-03 00:25:33.769352', 3, x'4a799f4750894b7ebc1853567141e380', 0, 23, 'lvcystzlq6fqskkkyeeo', '2')